

class चीज़(object):
    implementaciones = NotImplemented

    def __init__(खुद, स्थान=(0, 0), आपेक्षिक_स्थान=(0, 0), माप=(0, 0), आपेक्षिक_माप=(0, 0), से_मापना='उ-प'):

        खुद.अरूप = None

        खुद.स्थान = स्थान
        if not isinstance(आपेक्षिक_स्थान, tuple):
            आपेक्षिक_स्थान = (आपेक्षिक_स्थान, आपेक्षिक_स्थान)
        खुद.आपेक्षिक_स्थान = आपेक्षिक_स्थान

        खुद.माप = माप
        if not isinstance(आपेक्षिक_माप, tuple):
            आपेक्षिक_माप = (आपेक्षिक_माप, आपेक्षिक_माप)
        खुद.आपेक्षिक_माप = आपेक्षिक_माप

        खुद.से_मापना = से_मापना

        खुद.implementación = None

    def बनाना(खुद, अरूप, तरह):

        try:
            खुद.implementación = खुद.implementaciones[तरह](खुद)
        except KeyError:
            raise ValueError('आपने बड़ी ग़ल्ती की।')

        खुद.अरूप = अरूप
        खुद.implementación.बनाना()

    def हटाना(खुद, तरफ़=None):
        खुद.implementación.हटाना(तरफ़=तरफ़)

    def दिखाना(खुद):
        खुद.implementación.दिखाना()

    def चिपाना(खुद):
        खुद.implementación.चिपाना()

    def रखना(खुद, स्थान=(0, 0), आपेक्षिक_स्थान=(0, 0), से_मापना='उ_प'):
        खुद.implementación.रखना(स्थान, आपेक्षिक_स्थान, से_मापना)

    def माप_देना(खुद, माप, आपेक्षिक_माप):
        खुद.implementación.माप_देना()
