import tkinter as tk

from डिब्बा.चीज़ import चीज़
from डिब्बा.implementaciones import implementación


class डिब्बा(चीज़):
    implementaciones = {
        'TK': डिब्बा_टिके
    }

    def __init__(खुद, स्थान, आपेक्षिक_स्थान, माप, आपेक्षिक_माप):

        super().__init__(स्थान, आपेक्षिक_स्थान, माप, आपेक्षिक_माप)

    def जोड़ना(खुद, जोड़ी_हुई_चीज़):
        """
        
        :param जोड़ी_हुई_चीज़:
        :type जोड़ी_हुई_चीज़: चीज़
        
        """

        जोड़ी_हुई_चीज़.बनाना(मूल=खुद, अरूप=खुद.अरूप)


class डिब्बा_टिके(implementación):

    def __init__(खुद, मूल):

        खुद.डिब्बा_बाहर = tk.Frame(मूल.माता_पिता())
        खुद.डिब्बा_अंदर = tk.Frame(खुद.डिब्बा_बाहर)

        super().__init__(मूल=मूल)

    def हटाना(खुद, तरफ़=None):
        if तरफ़ is not None:
            खुद.चिपाना(तरफ़=तरफ़)
        खुद.डिब्बा_बाहर.destroy()

    def दिखाना(खुद):
        pass

    def बनाना(खुद):
        खुद.डिब्बा_बाहर.place(x=खुद.मूल.स्थान[0], y=खुद.मूल.स्थान[1], relx=खुद.मूल.आपेक्षिक_स्थान[0], rely=खुद.मूल.आपेक्षिक_स्थान[1],
                              width=खुद.मूल.माप[0], height=खुद.मूल.माप[1],
                              relwidth=खुद.मूल.आपेक्षिक_माप[0], relheight=खुद.मूल.आपेक्षिक_माप[1],
                              anchor=खुद.मूल.से_मापना)
        खुद.डिब्बा_अंदर.place(x=0, y=0, relx=0, rely=0, relwidth=1, relheight=1, anchor=खुद.मूल.से_मापना)

    def रखना(खुद, स्थान=(0, 0), आपेक्षिक_स्थान=(0, 0), से_मापना='उ_प'):
        खुद.डिब्बा_बाहर.place(x=स्थान[0], y=स्थान[1], relx=आपेक्षिक_स्थान[0],
                              rely=आपेक्षिक_स्थान[1], anchor=खुद.मूल.से_मापना)

    def चिपाना(खुद, तरफ़):
        pass
